[
  {
    "title": "NAISSANCE",
    "year": 1989,
    "description": "Né de parents d'origine guinéenne, Alpha Wann passe les dix premières années de sa vie à Fontenay-aux-Roses, au sud de Paris. Il emménage ensuite dans le 14e arrondissement de Paris dans le quartier de Pernety. Il s'imprègne de la culture hip-hop dès son plus jeune âge, faisant partie de la génération MTV."
  },
  {
    "title": "L'Entourage",
    "year": 2008,
    "description": "Alpha Wann s'illustre d'abord au sein du groupe 1995 dont il est le fondateur avec Areno Jaz3. Le groupe accueille par la suite Nekfeu ou encore Sneazzy. Ils sortent l'EP La Source en juin 2011 qui bénéficie d'un coup de projecteur grâce à sa diffusion sur Internet. La même année, Wann collabore avec Nekfeu sur En sous-marin, net-tape de neuf titres."
  },
  {
    "title": "Don Dada",
    "year": 2013,
    "description": "Wann crée son propre label, Don Dada Records, en 2013 avec Hologram Lo' et Marguerite du Bled5. Il se lance dans une carrière en solo à partir de 2014. Il sort son premier EP, Alph Lauren. Deux ans plus tard, il publie son deuxième EP, Alph Lauren 2. Il est suivi de Alph Lauren 3, paru en 2018."
  },
  {
    "title": "Don Dada Athletics",
    "year": 2015,
    "description": "En parallèle à la musique, depuis 2015, toujours avec son acolyte Hologram’ Lo, il produit du textile sous l’enseigne Don Dada Athletics. La marque propose entre autres des sweat-shirts, t-shirts et casquettes. Au fil des années, elle s’affirme pour aujourd’hui délivrer des gammes plus fournies et abouties. Les collections qui sont annoncées sont à chaque fois très attendues par les fans, comme en témoignent les ruptures de stocks en quelques minutes, à chaque sortie."
  },
  {
    "title": "UMLA",
    "year": 2018,
    "description": "Le 21 septembre 2018, Wann sort son premier album, Une main lave l'autre, aussi stylisé UMLA (prononcer : U-M-L-A distinctement). Il est bien reçu par la critique et se classe dixième dans les charts français. L'album est certifié disque d'or en juin 2020."
  }
]
